In [1]:
import pandas as pd

In [5]:
var = pd.DataFrame({"A":[1,2,3,5,],"B":[15,16,17,18]})

In [30]:
var

   A   B   c   D   E         F  python
0  1  15  16 -14  15  0.066667    True
1  2  16  18 -14  32  0.125000    True
2  3  17  20 -14  51  0.176471    True
3  5  18  23 -13  90  0.277778    True

In [31]:
var["c"] = var["A"] + var["B"]  # creating a new coloumn

In [32]:
var

   A   B   c   D   E         F  python
0  1  15  16 -14  15  0.066667    True
1  2  16  18 -14  32  0.125000    True
2  3  17  20 -14  51  0.176471    True
3  5  18  23 -13  90  0.277778    True

In [33]:
var["D"] = var["A"] - var["B"]

In [34]:
var["E"] = var["A"] * var["B"]

In [35]:
var['F'] = var["A"] / var["B"]

In [36]:
var

   A   B   c   D   E         F  python
0  1  15  16 -14  15  0.066667    True
1  2  16  18 -14  32  0.125000    True
2  3  17  20 -14  51  0.176471    True
3  5  18  23 -13  90  0.277778    True

In [37]:
# now getting the logical values in the pandas

In [17]:
var["python"] = var["c"]<25

In [18]:
var

   A   B   c   D   E         F  python
0  1  15  16 -14  15  0.066667    True
1  2  16  18 -14  32  0.125000    True
2  3  17  20 -14  51  0.176471    True
3  5  18  23 -13  90  0.277778    True

In [23]:
p = {"a":[1,2,3,4,5],"b":[6,7,8,9,11]}  # dictionary should always be of same length

In [24]:
pd.DataFrame(p)

   a   b
0  1   6
1  2   7
2  3   8
3  4   9
4  5  11

In [25]:
var2 = pd.DataFrame([[1,2,3],[10,11,12],[13,14,15,16]])  # for lists its okay

In [22]:
var2

    0   1   2     3
0   1   2   3   NaN
1  10  11  12   NaN
2  13  14  15  16.0

In [28]:
check = {"s":pd.Series([1,2,3,4,5]),"p":pd.Series([10,11,12,13,14,15])} # it can b filled like this

In [29]:
pd.DataFrame(check)

     s   p
0  1.0  10
1  2.0  11
2  3.0  12
3  4.0  13
4  5.0  14
5  NaN  15